####################################################################################
# POSICIONAMIENTO
####################################################################################

set_app_options -name time.disable_recovery_removal_checks -value false
set_app_options -name time.disable_case_analysis -value false
set_app_options -name place.coarse.continue_on_missing_scandef -value true
set_app_options -name opt.common.user_instance_name_prefix -value place

place_opt
legalize_placement
check_legality -verbose

