###################################################################

# Created by write_sdc on Sat Nov  8 18:15:35 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_load -pin_load 1.5 [get_ports o_uart0_rx]
set_load -pin_load 1.5 [get_ports o_uart0_cts]
set_load -pin_load 1.5 [get_ports o_uart1_rx]
set_load -pin_load 1.5 [get_ports o_uart1_cts]
set_load -pin_load 1.5 [get_ports {ddr3_dq[15]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[14]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[13]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[12]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[11]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[10]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[9]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[8]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[7]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[6]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[5]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[4]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[3]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[2]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[1]}]
set_load -pin_load 1.5 [get_ports {ddr3_dq[0]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[12]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[11]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[10]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[9]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[8]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[7]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[6]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[5]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[4]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[3]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[2]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[1]}]
set_load -pin_load 1.5 [get_ports {ddr3_addr[0]}]
set_load -pin_load 1.5 [get_ports {ddr3_ba[2]}]
set_load -pin_load 1.5 [get_ports {ddr3_ba[1]}]
set_load -pin_load 1.5 [get_ports {ddr3_ba[0]}]
set_load -pin_load 1.5 [get_ports ddr3_ras_n]
set_load -pin_load 1.5 [get_ports ddr3_cas_n]
set_load -pin_load 1.5 [get_ports ddr3_we_n]
set_load -pin_load 1.5 [get_ports ddr3_odt]
set_load -pin_load 1.5 [get_ports ddr3_reset_n]
set_load -pin_load 1.5 [get_ports ddr3_cke]
set_load -pin_load 1.5 [get_ports {ddr3_dm[1]}]
set_load -pin_load 1.5 [get_ports {ddr3_dm[0]}]
set_load -pin_load 1.5 [get_ports {ddr3_dqs_p[1]}]
set_load -pin_load 1.5 [get_ports {ddr3_dqs_p[0]}]
set_load -pin_load 1.5 [get_ports {ddr3_dqs_n[1]}]
set_load -pin_load 1.5 [get_ports {ddr3_dqs_n[0]}]
set_load -pin_load 1.5 [get_ports ddr3_ck_p]
set_load -pin_load 1.5 [get_ports ddr3_ck_n]
set_load -pin_load 1.5 [get_ports {mtxd_pad_o[3]}]
set_load -pin_load 1.5 [get_ports {mtxd_pad_o[2]}]
set_load -pin_load 1.5 [get_ports {mtxd_pad_o[1]}]
set_load -pin_load 1.5 [get_ports {mtxd_pad_o[0]}]
set_load -pin_load 1.5 [get_ports mtxen_pad_o]
set_load -pin_load 1.5 [get_ports mtxerr_pad_o]
set_load -pin_load 1.5 [get_ports md_pad_io]
set_load -pin_load 1.5 [get_ports mdc_pad_o]
set_load -pin_load 1.5 [get_ports phy_reset_n]
create_clock [get_ports brd_clk_p]  -name BRD_CLK_P  -period 3  -waveform {0 1.5}
create_clock [get_ports mtx_clk_pad_i]  -name mtx_clk  -period 40  -waveform {0 20}
set_clock_uncertainty 0.1  [get_clocks mtx_clk]
create_clock [get_ports mrx_clk_pad_i]  -name mrx_clk  -period 40  -waveform {0 20}
set_clock_uncertainty 0.1  [get_clocks mrx_clk]
set_input_delay -clock mrx_clk  0.1  [get_ports quick_n_reset]
set_input_delay -clock mrx_clk  0.1  [get_ports brd_rst]
set_input_delay -clock mrx_clk  0.1  [get_ports i_uart0_rts]
set_input_delay -clock mrx_clk  0.1  [get_ports i_uart0_tx]
set_input_delay -clock mrx_clk  0.1  [get_ports i_uart1_rts]
set_input_delay -clock mrx_clk  0.1  [get_ports i_uart1_tx]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[15]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[14]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[13]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[12]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[11]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[10]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[9]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[8]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[7]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[6]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[5]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[4]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[3]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[2]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[1]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dq[0]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dqs_p[1]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dqs_p[0]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dqs_n[1]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {ddr3_dqs_n[0]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {mrxd_pad_i[3]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {mrxd_pad_i[2]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {mrxd_pad_i[1]}]
set_input_delay -clock mrx_clk  0.1  [get_ports {mrxd_pad_i[0]}]
set_input_delay -clock mrx_clk  0.1  [get_ports mrxdv_pad_i]
set_input_delay -clock mrx_clk  0.1  [get_ports mrxerr_pad_i]
set_input_delay -clock mrx_clk  0.1  [get_ports mcoll_pad_i]
set_input_delay -clock mrx_clk  0.1  [get_ports mcrs_pad_i]
set_input_delay -clock mrx_clk  0.1  [get_ports md_pad_io]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[15]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[14]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[13]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[12]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[11]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[10]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[9]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[8]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[7]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[6]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[5]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[4]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[3]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[2]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[1]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dq[0]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dqs_p[1]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dqs_p[0]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dqs_n[1]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dqs_n[0]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports md_pad_io]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports o_uart0_rx]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports o_uart0_cts]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports o_uart1_rx]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports o_uart1_cts]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[12]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[11]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[10]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[9]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[8]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[7]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[6]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[5]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[4]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[3]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[2]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[1]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_addr[0]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_ba[2]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_ba[1]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_ba[0]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_ras_n]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_cas_n]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_we_n]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_odt]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_reset_n]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_cke]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dm[1]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {ddr3_dm[0]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_ck_p]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports ddr3_ck_n]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {mtxd_pad_o[3]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {mtxd_pad_o[2]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {mtxd_pad_o[1]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports {mtxd_pad_o[0]}]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports mtxen_pad_o]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports mtxerr_pad_o]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports mdc_pad_o]
set_output_delay -clock mrx_clk  -max 0.1  [get_ports phy_reset_n]
set_input_transition -max 0.02  [get_ports quick_n_reset]
set_input_transition -min 0.02  [get_ports quick_n_reset]
set_input_transition -max 0.02  [get_ports brd_rst]
set_input_transition -min 0.02  [get_ports brd_rst]
set_input_transition -max 0.02  [get_ports brd_clk_n]
set_input_transition -min 0.02  [get_ports brd_clk_n]
set_input_transition -max 0.02  [get_ports brd_clk_p]
set_input_transition -min 0.02  [get_ports brd_clk_p]
set_input_transition -max 0.02  [get_ports i_uart0_rts]
set_input_transition -min 0.02  [get_ports i_uart0_rts]
set_input_transition -max 0.02  [get_ports i_uart0_tx]
set_input_transition -min 0.02  [get_ports i_uart0_tx]
set_input_transition -max 0.02  [get_ports i_uart1_rts]
set_input_transition -min 0.02  [get_ports i_uart1_rts]
set_input_transition -max 0.02  [get_ports i_uart1_tx]
set_input_transition -min 0.02  [get_ports i_uart1_tx]
set_input_transition -max 0.02  [get_ports {ddr3_dq[15]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[15]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[14]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[14]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[13]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[13]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[12]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[12]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[11]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[11]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[10]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[10]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[9]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[9]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[8]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[8]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[7]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[7]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[6]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[6]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[5]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[5]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[4]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[4]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[3]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[3]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[2]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[2]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[1]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[1]}]
set_input_transition -max 0.02  [get_ports {ddr3_dq[0]}]
set_input_transition -min 0.02  [get_ports {ddr3_dq[0]}]
set_input_transition -max 0.02  [get_ports {ddr3_dqs_p[1]}]
set_input_transition -min 0.02  [get_ports {ddr3_dqs_p[1]}]
set_input_transition -max 0.02  [get_ports {ddr3_dqs_p[0]}]
set_input_transition -min 0.02  [get_ports {ddr3_dqs_p[0]}]
set_input_transition -max 0.02  [get_ports {ddr3_dqs_n[1]}]
set_input_transition -min 0.02  [get_ports {ddr3_dqs_n[1]}]
set_input_transition -max 0.02  [get_ports {ddr3_dqs_n[0]}]
set_input_transition -min 0.02  [get_ports {ddr3_dqs_n[0]}]
set_input_transition -max 0.02  [get_ports mtx_clk_pad_i]
set_input_transition -min 0.02  [get_ports mtx_clk_pad_i]
set_input_transition -max 0.02  [get_ports mrx_clk_pad_i]
set_input_transition -min 0.02  [get_ports mrx_clk_pad_i]
set_input_transition -max 0.02  [get_ports {mrxd_pad_i[3]}]
set_input_transition -min 0.02  [get_ports {mrxd_pad_i[3]}]
set_input_transition -max 0.02  [get_ports {mrxd_pad_i[2]}]
set_input_transition -min 0.02  [get_ports {mrxd_pad_i[2]}]
set_input_transition -max 0.02  [get_ports {mrxd_pad_i[1]}]
set_input_transition -min 0.02  [get_ports {mrxd_pad_i[1]}]
set_input_transition -max 0.02  [get_ports {mrxd_pad_i[0]}]
set_input_transition -min 0.02  [get_ports {mrxd_pad_i[0]}]
set_input_transition -max 0.02  [get_ports mrxdv_pad_i]
set_input_transition -min 0.02  [get_ports mrxdv_pad_i]
set_input_transition -max 0.02  [get_ports mrxerr_pad_i]
set_input_transition -min 0.02  [get_ports mrxerr_pad_i]
set_input_transition -max 0.02  [get_ports mcoll_pad_i]
set_input_transition -min 0.02  [get_ports mcoll_pad_i]
set_input_transition -max 0.02  [get_ports mcrs_pad_i]
set_input_transition -min 0.02  [get_ports mcrs_pad_i]
set_input_transition -max 0.02  [get_ports md_pad_io]
set_input_transition -min 0.02  [get_ports md_pad_io]
